{
  "論理演算": "コンピュータが情報を処理する際の最も基本的な計算方法。「AND（論理積）」「OR（論理和）」「NOT（否定）」「XOR（排他的論理和）」などがあり、複数の条件が「すべて真か（AND）」や「いずれかが真か（OR）」を判断するために使われます。",
  "ハッシュ関数": "任意の長さのデータを、固定の短い長さのデータ（ハッシュ値）に変換する関数のことです 。データを整理・検索する際に、高速なアクセスを実現するために使われます。例えば、大量の顧客データから特定の顧客を素早く見つけるために、氏名をハッシュ関数にかけて得られたハッシュ値で格納場所を決めたりします 。",
  "ハッシュ表": "ハッシュ関数を使ってデータを格納する表（データ構造）です 。キー（氏名など）をハッシュ関数で変換し、その結果（ハッシュ値）を配列の添え字（インデックス）として格納場所を決定します 。これにより、データの検索が非常に高速になります。",
  "ASCIIコード": "アルファベット、数字、記号などをコンピュータで扱うために、各文字に割り当てられた固有の番号のことです 。'a'は97、'b'は98のように連続した番号が振られています 。",
  "キャッシュメモリ": "CPU（中央処理装置）と主記憶装置（メインメモリ）の間にある、非常に高速なメモリ 。CPUがよく使うデータを一時的に保存しておくことで、わざわざ低速な主記憶装置へアクセスする回数を減らし、処理速度を向上させます。",
  "ヒット率": "CPUがデータを探しにいったとき、目的のデータがキャッシュメモリ上に存在する確率のこと 。ヒット率が高いほど、コンピュータの処理は高速になります。",
  "MTBF": "システムが故障から復旧した後、次に故障するまでの平均時間のこと 。この時間が長いほど、システムが壊れにくく信頼性が高いことを示します。",
  "MTTR": "システムが故障してから、修理が完了して復旧するまでの平均時間のこと 。この時間が短いほど、故障からの回復が早く、保守性が高いことを示します。",
  "稼働率": "システムが正常に稼働している時間の割合。「稼働率 = MTBF / (MTBF + MTTR)」で計算されます 。",
  "マッシュアップ": "複数の異なるWebサービスを組み合わせて、新しい独自のサービスを作る手法 。特に、あるサービスの出力を別のサービスの入力として処理を連結させるものを「ロジックマッシュアップ」と呼びます 。",
  "アンチエイリアシング": "コンピュータのディスプレイ上で、斜めの線や曲線の縁に現れるギザギザ（ジャギー）を、中間色を置くことで滑らかに見せる技術のことです 。",
  "シェーディング": "コンピュータグラフィックスにおいて、3Dモデルの表面に光の当たり具合をシミュレートし、色や明るさの変化を付けることで、物体に立体感や質感を表現する技術のことです。",
  "テクスチャマッピング": "コンピュータグラフィックスにおいて、3Dモデルの表面に、画像（テクスチャ）を貼り付けることで、その物体の質感や模様、詳細な見た目を表現する技術のことです。",
  "バンプマッピング": "コンピュータグラフィックスにおいて、3Dモデルの表面に視覚的な凹凸を表現する技術の一つです。実際にモデルの形状を変えることなく、光の計算によって陰影を変化させることで、表面に「デコボコ」があるかのように見せることができます。",
  "DBMS": "データベースを効率的かつ安全に管理するためのソフトウェア。データの検索、追加、更新、削除などの機能を提供します。",
  "原子性": "トランザクション処理（一連の関連する処理）の特性の一つ 。処理全体が「全て成功する」か「全て失敗する（元に戻る）」かのどちらかであることが保証される性質を指します。「All or Nothing」の原則とも呼ばれます 。",
  "LAN間接続装置": "リピータ、ブリッジ、ルータ、ゲートウェイなど、ネットワーク同士を接続するための機器の総称です 。",
  "リピータ": "物理層で動作し、減衰した信号を増幅・整形して伝送距離を延長します。",
  "ブリッジ": "データリンク層で動作し、MACアドレスを見てフレームを中継します。",
  "ルータ": "ネットワーク層で動作し、IPアドレスを見てパケットを最適な経路に中継します。",
  "ゲートウェイ": "プロトコルが異なるネットワーク同士を接続するために、プロトコルの変換を行います。",
  "ペネトレーションテスト": "システムのセキュリティを検証するため、攻撃者の視点で実際にネットワークやサーバに侵入を試みるテストのこと 。「侵入テスト」とも呼ばれます。",
  "SQLインジェクション": "Webアプリケーションの脆弱性を利用する攻撃の一つ。入力フォームに不正なSQL文を「注入（injection）」することで、データベースを不正に操作します 。",
  "プレースホルダ": "SQLインジェクション対策として用いられる、SQL文を安全に組み立てるための仕組み 。SQL文の骨格と、後から埋め込む値を分離して扱うことで、入力値がSQL文として解釈されるのを防ぎます 。",
  "スタブ": "ソフトウェアのテスト手法の一つであるトップダウンテストで使われる、ダミーのモジュール（部品） 。未完成の下位モジュールの代わりに、仮の応答を返す役割を持ちます 。",
  "スクラム": "アジャイル開発というソフトウェア開発手法の一つ 。「スプリント」と呼ばれる短い期間（1〜4週間）で開発サイクルを回し、日々の進捗確認（デイリースクラム）などを通じてチームで協力しながら開発を進めます 。",
  "アローダイアグラム": "プロジェクト管理で使われる図の一種。作業（アクティビティ）を矢印で、作業の開始・終了点を丸で示し、プロジェクト全体の流れや所要時間などを把握するために用います。",
  "非構造化データ": "テキスト、画像、音声、動画のように、決まった形式を持たないデータのこと 。そのままでは分析が難しいため、分析の前段階で、意味のある単位に分解して構造化データに加工する必要があります 。",
  "コアコンピタンス": "企業の活動において、他社には真似のできない、競争優位の源泉となる中核的な能力や技術のことです 。",
  "ブルーオーシャン": "マーケティング戦略において、まだ競争相手のいない、未知の新しい市場領域のこと 。激しい価格競争が繰り広げられる既存市場「レッドオーシャン」の対義語です。",
  "HRテック": "HR（Human Resources：人事）とテクノロジーを組み合わせた言葉。ビッグデータ解析やAIなどのIT技術を人事業務（採用、育成、評価など）に活用し、業務改善や効率化を図るソリューションのことです 。",
  "相関係数": "二つの変数の間にある関係の強さを示す指標 。-1から1の間の値をとり、1に近いほど「正の相関」（一方が増えるともう一方も増える）、-1に近いほど「負の相関」（一方が増えるともう一方は減る）が強いことを示します 。",
  "産業財産権": "産業の発展を目的とする知的財産権の総称で、「特許権」「実用新案権」「意匠権」「商標権」の4つを指します 。",
  "関数": "特定の処理をひとまとめにしたもので、名前を付けて呼び出すことで何度でも利用できます 。引数（入力値）を受け取り、処理結果を戻り値（返り値）として返すことができます 。",
  "引数": "関数や手続を呼び出す際に、処理に必要な情報として渡す値のことです 。",
  "配列": "同じ型のデータを、連続したメモリ領域にまとめて格納するデータ構造 。各データには「要素番号（添え字）」が振られており、その番号を指定してデータにアクセスします 。",
  "無向グラフ": "頂点（ノード）と、それらを結ぶ辺（エッジ）から構成される図 。辺に向きがなく、どちらの方向からもたどれるグラフを指します 。",
  "隣接行列": "グラフの頂点間の接続関係を行列で表現したものです 。頂点iと頂点jの間に辺があれば行列の(i, j)成分が1、なければ0となります 。",
  "マージ": "整列（ソート）アルゴリズムで使われる操作の一つで、既に昇順（または降順）に並んでいる複数のデータ列を、一つにまとめながら整列させることです 。",
  "関連度": "データマイニングにおいて、ある事象と別の事象が同時に発生する度合いを示す指標 。「この商品を買った人は、この商品も買いやすい」といった傾向（アソシエーションルール）を発見するために使われます 。",
  "SaaS": "インターネット経由でソフトウェアの機能を提供するサービス形態 。利用者はソフトウェアを自分のPCにインストールすることなく、Webブラウザなどからサービスを利用できます。",
  "BYOD": "従業員が個人で所有しているスマートフォンやPCなどの端末を、業務に利用することです 。",
  "リモートデスクトップ": "手元のPCから、ネットワーク経由で遠隔地にある別のPCのデスクトップ画面を呼び出し、操作する技術 。",
  "2要素認証": "ログイン時の本人確認において、2種類の異なる要素を組み合わせて認証する方法 。一般的に「知識情報（パスワードなど）」「所持情報（スマートフォンなど）」「生体情報（指紋など）」のうち、2つを要求することでセキュリティを高めます。"
}